const uaTranslations = {
  translation: {
    navigation: {
      home: "Головна",
      explore: "Знайти",
      notifications: "Сповіщення",
      messages: "Повідомлення",
      lists: "Списки",
      bookmarks: "Закладки",
      communities: "Спільноти",
      profile: "Профіль",
      settings: "Налаштування",
      users: "Користувачі",
    },
    settings: {
      themeTitle: "Виберіть тему:",
      themeLight: "Світла",
      themeDark: "Темна",
      themeTurquoise: "Фіолетова",
      themeBlue: "Синя",
      themeBubblegum: "Баблгам",
      languageTitle: "Виберіть мову:",
      languageEn: "Англійська",
      languageUk: "Українська",
      password: "Змінити пароль",
    },
    btn: {
      post: "Створити пост",
      existingAccount: "Додати наявний профіль",
      logOut: "Вийти з профілю",
      drafts: "Чорнетки",
      editProfile: "Редагувати профіль",
      logIn: "Увійти",
      signUp: "Зареєструватися",
      forgotPassword: "Забули пароль ?",
      publish: "Опублікувати",
      follow: "Слідкувати",
      unsubscribe: "Відписатись",
      save: "Зберегти",
      create: "Створити",
      next: "Далі",
      page: "Повернутися на сторінку логінування",
      restore: "Відновити",
      delete: "Видалити",
      cancel: "Скасувати",
      back: "Повернутися на попередню сторінку",
      refresh: "Спробуйте перезавантажити сторінку",
      log: "Будь ласка, увійдіть ще раз.",
    },
    userProfile: {
      joined: "Дата приєднання",
      birthday: "День народження",
      form: {
        name: "Ім’я",
        lastName: "Прізвище",
        bio: "Про себе",
        location: "Місцезнаходження",
        website: "Веб-сайт",
        birthDate: "Дата народження",
      },
    },
    authPage: {
      title: "В курсі того, що відбувається",
      subTitle: {
        first: "Приєднуйтесь сьогодні.",
        second: "Вже зареєстровані?",
      },
      or: "або",
      privacy:
        "Реєструючись, ви погоджуєтеся з Умовами надання послуг і Політикою конфіденційності, а також з Політикою використання файлів cookie.",
    },
    modalLogIn: {
      title: "Увійдіть до TwettryBust",
      from: {
        email: "Email:",
        password: "Пароль:",
      },
      loginErorr: "Невірний email або пароль",
      subTitle: "Не маєте облікового запису?",
    },
    modalSignUp: {
      title: "Зареєструватися в TwettryBust",
      from: {
        name: "Ім’я:",
        email: "Email:",
        password: "Пароль:",
        confirmPassword: "Підтвердіть пароль:",
      },
      modalAfterSignUp: {
        title: "Підтвердження адреси електронної пошти",
        text: " Вітаємо з успішною реєстрацією! Для завершення процесу підтвердіть свою адресу електронної пошти. Перевірте папку «Спам», якщо лист не з'явиться протягом кількох хвилин. Після підтвердження ви зможете увійти та використовувати TwettryBust. Дякуємо за реєстрацію!",
      },
    },
    placeholder: {
      text: "Що цікавого розповісти...?!",
      text2: "Пошук особистих повідомлень",
      text3: "Пошук",
      search: "Пошук",
      email: "Електронна пошта",
      password: "Введіть новий пароль",
      confirmPassword: "Введіть ще раз новий пароль",
      post: "Пост не може бути порожнім",
    },
    communities: {
      title: "Спільноти",
      titlePage: "Відкриті спільноти",
      rules: {
        title: "Правила",
        context:
          "Ці правила встановлені та дотримуються адміністраторами спільноти та є додатковими правилами.",
        ruleOne: "Будьте поважними",
        contextOne:
          "Ми сприяємо конструктивним та продуктивним коментарям, висловленим доброзичливим та продуктивним способом.",
        ruleTwo: "Зберігайте дописи за темою",
        contextTwo:
          "Усі дописи, відповіді та цитати повинні бути пов'язані з дизайном. Матеріал, що не стосується теми, буде видалено.",
        ruleThree: "Вказуйте авторство творчої роботи",
        contextThree:
          "Вказуйте відповідну авторську згоду та не порушуйте інтелектуальні права інших. Не розміщуйте матеріали, захищені авторським правом, без дозволу або належної атрибуції.",
        ruleFour: "Включайте контекст дизайну",
        contextFour:
          "При поширенні дизайну включайте хоча б якийсь контекст — наприклад, як ви його створили або що вас надихнуло. Дописи без достатнього контексту можуть бути переглянуті.",
        ruleFive: "Заборона просування NFT або криптопроектів",
        contextFive:
          "Реклама, пов'язана з NFT або криптовалютами, заборонена через можливість шахрайства.",
      },
      search:"Пошук груп",
    },
    sidebar: {
      recommended: "Рекомендовані",
      willRecommendations: "Тут будуть рекомендації для вас",
      followGroups: "Ви підписані на ці групи",
      followUsers: " Ви підписані на цих користуачів",
    },
    bookmarks: {
      pageTitle: "Закладки",
      noBookmarksTitle: "Тут будуть Ваші закладки.",
      noBookmarksText: "Ви ще не зберегли жодного поста.",
    },
    messages: {
      title: "Повідомлення",
      nweMessage: "Нове повідомлення",
      noMessages: "У вас немає жодного повідомлення",
      search: "Спробуйте шукати людей, групи чи повідомлення",
      select: "Виберіть повідомлення",
      selectText:
        "Виберіть із наявних розмов, почніть нову або просто продовжуйте діалог",
      deleteInfo:
        " Це повідомлення буде видалено для вас. Інші люди в розмові все одно його бачитимуть.",
    },
    profile: {
      noPosts: "постів",
      noPostsText:
        "Створіть цікавий пост, аби поділитися своїми думками чи спогадами з іншими. І коли ви це зробите, він з’явиться тут.",
      notYet: "У вас ще немає",
      favorites: "вибраних",
      favoritesText:
        "Щоб показувати у своєму профілі вибрані додайте його в пості. Коли ви це зробите, він з’явиться тут.",
      mediaText:
        "Коли ви публікуєте фотографії чи відео, вони відображатимуться тут.",
      media: 'медіафайлів',
      likesText:
        "Торкніться сердечка на пості, щоб уподобати його. Коли ви це зробите, він з’явиться тут.",
      likes: 'вподобань',
      followers: "Підписники",
      following: "Підписки",
      noFollowers:
        "Коли хтось підписується на цей акаунт, вони з'являються тут. Публікація та взаємодія з іншими допомагає збільшити кількість підписників.",
      noFollowersTitle: "Шукаєте підписників?",
      noFollowing:
        "Підписка на акаунти - це легкий спосіб формування вашого хронологічного ленти та знаходження того, що відбувається з темами та людьми, які вас цікавлять.",
      noFollowingTitle: "Будьте в курсі",
      edit: "Редагувати профіль",
      posts: "Пости",
      highlights: "Вибране",
      media2: "Медіа",
      likes2: "Лайки",
      modalUnfollow:
        "Їхні пости більше не будуть відображатися у вашому таймлайні 'Для вас'. Ви все ще зможете переглядати їх профіль, якщо їх пости не захищені.",
      modalFollow:
        "Їхні пости будуть відображатися у вашому таймлайні 'Для вас'. Ви також зможете переглядати їх профіль. ",
      reposted: "перепостити",
      follows: "Підписаний/а на вас",
    },
    home: {
      forYouTitle: "Для вас",
      followingTitle: "Стрічка підписок",
      noFollowing:
        "Це найкраще місце, щоб бачити, що відбувається у вашому світі. Знайдіть деяких людей та теми для підписки зараз.",
      welcome: "Ласкаво просимо до TwettryBust!",
    },
    delete: {
      comment: "Видалити коментар",
      post: "Видалити пост",
      message: "Видалити повідомлення",
      chat: "Видалити чат",
    },
    popup: {
      unsubscribe:
        "Відписатись від користувача і не бачити його пости в 'Стрічці підписок'",
      subscribe:
        "Підписатись на користувача щоб бачити його пости в 'Стрічці підписок'",
      searchResults: "тут будуть ваші результати пошуку",
      repost: 'Репост',
      repostSuccessfully: 'Репост успішно виконано!',
    },
    forgotPassword: {
      title: "Знайдіть свій профіль на TwettryBust",
      explanation:
        " Введіть адресу електронної пошти,пов'язану з вашим профілем, щоб отримати запит на зміну паролю.",
      success:
        " Ваш запит на зміну пароля був успішно відправлений!Перевірте пошту для подальшої процедури відновлення паролю.",
      titleReset: "Відновлення паролю",
      successReset: "Пароль успішно змінений.",
    },
    notFound: {
      title: "Пост не знайдено",
      text: "Вибачте, але пост, який ви шукаєте, не існує або був видалений.",
      errorTitle: "Упс...помилка",
      error: "Сторінку завантажити не вдалося. Cкористайтеся діями нижче, щоб виправити це.",
    },
  },
};

export default uaTranslations;
