const uaTranslations = {
  translation: {
    navigation: {
      home: "Головна",
      explore: "Ознайомлення",
      notifications: "Сповіщення",
      messages: "Повідомлення",
      lists: "Списки",
      bookmarks: "Закладки",
      communities: "Спільноти",
      profile: "Профіль",
      settings: "Налаштування",
    },
    settings: {
      themeTitle: "Виберіть тему:",
      themeLight: "Світла",
      themeDark: "Темна",
      themeTurquoise: "Фіолетова",
      themeBlue: "Синя",
      themeBubblegum:"Баблгам",
      languageTitle: "Виберіть мову:",
      languageEn: "Англійська",
      languageUk: "Українська",
    },
    btn: {
      post: "Створити пост",
      existingAccount: "Додати наявний профіль",
      logOut: "Вийти з профілю",
      drafts: "Чорнетки",
      editProfile: "Редагувати профіль",
      logIn: "Увійти",
      signUp: "Зареєструватися",
      forgotPassword: "Забули пароль ?",
      publish: "Опублікувати",
      follow: 'Слідкувати',
      unsubscribe: 'Відписатись',
    },
    userProfile: {
      joined: "Дата приєднання",
      birthday: "День народження",
      form: {
        name: "Ім’я",
        lastName: "Прізвище",
        bio: "Про себе",
        location: "Місцезнаходження",
        website: "Веб-сайт",
        birthDate: "Дата народження",
      },
    },
    authPage: {
      title: "В курсі того, що відбувається",
      subTitle: {
        first: "Приєднуйтесь сьогодні.",
        second: "Вже зареєстровані?",
      },
      or: "або",
      privacy:
        "Реєструючись, ви погоджуєтеся з Умовами надання послуг і Політикою конфіденційності, а також з Політикою використання файлів cookie.",
    },
    modalLogIn: {
      title: "Увійдіть до TwettryBust",
      from: {
        email: "Email:",
        password: "Пароль:",
      },
      loginErorr: "Невірний email або пароль",
      subTitle: "Не маєте облікового запису?",
    },
    modalSignUp: {
      title: "Зареєструватися в TwettryBust",
      from: {
        name: "Ім’я:",
        email: "Email:",
        password: "Пароль:",
        confirmPassword: "Підтвердіть пароль:",
      },
      modalAfterSignUp: {
        title: "Підтвердження адреси електронної пошти",
        text: " Вітаємо з успішною реєстрацією! Для завершення процесу підтвердіть свою адресу електронної пошти. Перевірте папку «Спам», якщо лист не з'явиться протягом кількох хвилин. Після підтвердження ви зможете увійти та використовувати TwettryBust. Дякуємо за реєстрацію!",
      },
    },
    placeholder: {
      text: "Що цікавого розповісти...?!",
    },
    communities: {
      title: "Спільноти",
      titlePage: "Відкриті спільноти",
      rules: {
        title: "Правила",
        context:
          "Ці правила встановлені та дотримуються адміністраторами спільноти та є додатковими правилами.",
        ruleOne: "Будьте поважними",
        contextOne:
          "Ми сприяємо конструктивним та продуктивним коментарям, висловленим доброзичливим та продуктивним способом.",
        ruleTwo: "Зберігайте дописи за темою",
        contextTwo:
          "Усі дописи, відповіді та цитати повинні бути пов'язані з дизайном. Матеріал, що не стосується теми, буде видалено.",
        ruleThree: "Вказуйте авторство творчої роботи",
        contextThree:
          "Вказуйте відповідну авторську згоду та не порушуйте інтелектуальні права інших. Не розміщуйте матеріали, захищені авторським правом, без дозволу або належної атрибуції.",
        ruleFour: "Включайте контекст дизайну",
        contextFour:
          "При поширенні дизайну включайте хоча б якийсь контекст — наприклад, як ви його створили або що вас надихнуло. Дописи без достатнього контексту можуть бути переглянуті.",
        ruleFive: "Заборона просування NFT або криптопроектів",
        contextFive:
          "Реклама, пов'язана з NFT або криптовалютами, заборонена через можливість шахрайства.",
      },
    },
    sidebar: {
      recommended: 'Рекомендовані',
      willRecommendations: 'Тут будуть рекомендації для вас',
      followGroups: 'Ви підписані на ці групи',
      followUsers: ' Ви підписані на цих користуачів',
    },
    bookmarks: {
      pageTitle: 'Закладки',
      noBookmarksTitle: 'Тут будуть Ваші закладки.',
      noBookmarksText: 'Ви ще не зберегли жодного поста.',
    },
    messages: {
      title: 'Повідомлення',
      nweMessage: 'Нове повідомлення',
      noMessages: 'У вас немає жодного повідомлення',
      search: 'Спробуйте шукати людей, групи чи повідомлення',

    },
    profile: {
      noPosts: 'постів',
      noPostsText: 'Створіть цікавий пост, аби поділитися своїми думками чи спогадами з іншими. І коли ви це зробите, він з’явиться тут.',
      notYet: 'У вас ще немає',
      favorites: 'вибраних',
      favoritesText: 'Щоб показувати у своєму профілі вибрані додайте його в пості. Коли ви це зробите, він з’явиться тут.',
      media: 'медіафайлів',
      mediaText: 'Коли ви публікуєте фотографії чи відео, вони відображатимуться тут.',
      likes: 'вподобань',
      likesText: 'Торкніться сердечка на пості, щоб уподобати його. Коли ви це зробите, він з’явиться тут.',
    },
    home: {
      forYouTitle: 'Для вас',
      followingTitle: 'Стрічка підписок',
      noFollowing: 'Це найкраще місце, щоб бачити, що відбувається у вашому світі. Знайдіть деяких людей та теми для підписки зараз.',
      welcome: 'Ласкаво просимо до TwettryBust!'
    }
  },
};

export default uaTranslations;
