export const itemsFooter = [
    'О нас',
    'Скачать приложение Х',
    'Справочный центр',
    'Условия прелостваления услуг',
    'Политика конфиденциальности',
    'Политика в отношении файлов cookie',
    'Специальные возможности',
    'Информация о рекламе',
    'Блог',
    'Статус',
    'Работа',
  ]

  export const itemsFooter2 = [
    'Ресурсы бренда',
    'Реклама',
    'Маркетинг',
    'Х для бизнеса',
    'Разработчикам',
    'Каталог',
    'Настройки',
    '© 2024 X Corp.'
  ]